# Задача: используя цикл запрашивайте у пользователя число пока оно не станет больше 0, но меньше 10.
# После того, как пользователь введет корректное число, возведите его в степерь 2 и выведите на экран.
# Например, пользователь вводит число 123, вы сообщаете ему, что число не верное,
# и сообщаете об диапазоне допустимых. И просите ввести заного.
# Допустим пользователь ввел 2, оно подходит, возводим в степень 2, и выводим 4

print('Level: Normal\n Ex#1')
while True:
    user_num = int(input('Ведите число:'))
    if (0 <= user_num and user_num <= 9):
        print('Результат:' + str(user_num ** 2) + '\n')
        break
    else:
        print('Пожалуйста, ведите число от 0 до 9.')

# Задача-2: Исходные значения двух переменных запросить у пользователя.
# Поменять значения переменных местами. Вывести новые значения на экран.
# Решите задачу, используя только две переменные.
# Подсказки:
# * постарайтесь сделать решение через действия над числами;

print('Level: Normal\n Ex#2')
A = int(input('Введите A:'))
B = int(input('Введите B:'))

A = A + B
B = B - A
B = -B
A = A - B

print('Result> A:' + str(A) + ', B:' + str(B) + '\n')

# Создайте программу медицинская анкета, где вы запросите у пользователя такие данные, как имя, фамилию, возраст, и вес.
# И выведите результат согласно которому пациент в хорошем состоянии, если ему до 30 лет и вес от 50 и до 120 кг,
# Пациенту требуется начать вести правильный образ жизни, если ему более 30 и вес меньше 50 или больше 120 кг
# Пациенту требуется врачебный осмотр, если ему более 40 и вес менее 50 или больше 120 кг.
# Все остальные варианты вы можете обработать на ваш вкус и полет фантазии =)
# Формула не отражает реальной действительности и здесь используется только ради примера.

print('Level: Hard\n Ex#3')
name = input('Введите имя:')
surname = input('Введите фамилию:')
age = int(input('Введите возраст:'))
weight = int(input('Введите вес:'))

if age < 30 and 50 < weight < 120:
    print('\nРезультат:\n- пациент: '+name+' '+surname+' '+str(age)+'/'+str(weight)+'\n- заключение: Хорошее состояние.\n')
elif weight < 50 or weight > 120:
    if age > 40:
        print('\nРезультат:\n- пациент: ' + name + ' ' + surname + ' ' + str(age) + '/' + str(weight) + '\n- заключение: Требуется врачебный осмотр.\n')
    elif age > 30:
        print('\nРезультат:\n- пациент: ' + name + ' ' + surname + ' ' + str(age) + '/' + str(weight) + '\n- заключение: Начните вести ЗОЖ.\n')
    else:
        print('\nРезультат:\n- пациент: ' + name + ' ' + surname + ' ' + str(age) + '/' + str(weight) + '\n- заключение: пройдите к комплексное обследование.\n')
else:
    print('\nРезультат:\n- пациент: ' + name + ' ' + surname + ' ' + str(age) + '/' + str(
        weight) + '\n- заключение: прекрасная форма.\n')

