# Все задачи текущего блока решите с помощью генераторов списков!
import random
# Задание-1:
# Дан список, заполненный произвольными целыми числами.
# Получить новый список, элементы которого будут
# квадратами элементов исходного списка
# [1, 2, 4, 0] --> [1, 4, 16, 0]
print('\nLvl: easy, ex#1')
list1 = [1, 2, 4, 0]
list2 = [item ** 2 for item in list1]
print(list1, '=>', list2)
# Задание-2:
# Даны два списка фруктов.
# Получить список фруктов, присутствующих в обоих исходных списках.
print('\nLvl: easy, ex#2')
list1 = ['яблоко', 'груша', 'слива', 'манго']
list2 = ['банан', 'груша', 'слива']
list3 = [item for item in list2 if item in list1]
print(list1, list2, '=>', list3)
# Задание-3:
# Дан список, заполненный произвольными числами.
# Получить список из элементов исходного, удовлетворяющих следующим условиям:
# + Элемент кратен 3
# + Элемент положительный
# + Элемент не кратен 4
print('\nLvl: easy, ex#3')
list1 = [random.randint(-100,100) for _ in range(10)]
list2 = [item for item in list1 if (item % 2 == 0) and (item > 0) and (item % 4 !=0)]
print(list1, '=>', list2)
