# Задача-1:
# Дан список фруктов.
# Напишите программу, выводящую фрукты в виде нумерованного списка,
# выровненного по правой стороне.

# Пример:
# Дано: ["яблоко", "банан", "киви", "арбуз"]
# Вывод:
# 1. яблоко
# 2.  банан
# 3.   киви
# 4.  арбуз

# Подсказка: воспользоваться методом .format()

user_list=["яблоко", "банан", "киви", "арбуз"]
i=0
while i < len(user_list):
    print(str(i+1)+'.{:>7}'.format(user_list[i]))
    i+=1

# Задача-2:
# Даны два произвольные списка.
# Удалите из первого списка элементы, присутствующие во втором списке.
list1=['Удалите','из','первого','списка','элементы','присутствующие','во','втором','списке']
list2=['присутствующие','во','втором','списке']
print(list1,list2)
for item_l2 in list2:
    for item_l1 in list1:
        if item_l2==item_l1:
            list1.remove(item_l2)
print(list1)
# Задача-3:
# Дан произвольный список из целых чисел.
# Получите НОВЫЙ список из элементов исходного, выполнив следующие условия:
# если элемент кратен двум, то разделить его на 4, если не кратен, то умножить на два.
list3=[0,1,2,3,4,5,6,7,8,9]
print(list3)
i=0
for i in range(len(list3)):
    if int(list3[i])%2==0:
        list3[i]=int(list3[i])/4
        print(i,' : ',list3[i])
    else:
        list3[i] = int(list3[i])*2
        print(i, ' : ', list3[i])
    i+=1

print(list3)