# Задание - 1
# Вам даны 2 списка одинаковой длины, в первом списке имена людей, во втором зарплаты,
# вам необходимо получить на выходе словарь, где ключ - имя, значение - зарплата.
# Запишите результаты в файл salary.txt так, чтобы на каждой строке было 2 столбца,
# столбцы разделяются пробелом, тире, пробелом. в первом имя, во втором зарплата, например:
#  Vasya - 5000
# После чего прочитайте файл, выведите построчно имя и зарплату минус 13% (налоги ведь),
# Есть условие, не отображать людей получающих более зарплату 500000, как именно
#  выполнить условие решать вам, можете не писать в файл
# можете не выводить, подумайте какой способ будет наиболее правильным и оптимальным,
#  если скажем эти файлы потом придется передавать.
# Так же при выводе имя должно быть полностью в верхнем регистре!
# Подумайте вспоминая урок, как это можно сделать максимально кратко,
#  используя возможности языка Python.
import os
path = os.path.join('', 'salary.txt')

def make_file(summary):
    with open(path, 'w', encoding='UTF-8') as f:
        for key, val in summary:
            str_4_f = str(key) + ' - ' + str(val) + '\n'
            f.writelines(str_4_f)
    f.close()


def read_data():
    with open(path, 'r', encoding='UTF-8') as f:
        str_4_p = []
        for line in f:
            str_4_p.append(line.strip('\n').split(' - '))
    f.close()
    return str_4_p

def print_out(str_4_p, lim=150):
    for i in range(len(str_4_p)):
        str_4_p[i][1] = int(str_4_p[i][1])
        if str_4_p[i][1] < lim:
            print(str_4_p[i][0].upper() + ' ' + str(str_4_p[i][1] * 0.87))


names = ['Иван', 'Андрей', 'Ольга', 'Петр']
salary = [100, 150, 130, 110]

summary = zip(names, salary)

make_file(summary)
results=read_data()
print_out(results,130)
